{
  "_name_or_path": "microsoft/layoutlmv3-base",
  "architectures": [
    "LayoutLMv3ForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "coordinate_size": 128,
  "eos_token_id": 2,
  "has_relative_attention_bias": true,
  "has_spatial_attention_bias": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "aadhaar",
    "1": "audited_financials",
    "2": "balance_sheet",
    "3": "bank_statement",
    "4": "board_resolution",
    "5": "cash_flow_statement",
    "6": "form_16",
    "7": "gstr_1",
    "8": "gstr_3b",
    "9": "guarantee_letter",
    "10": "indemnity_bond",
    "11": "itr_full",
    "12": "itr_v",
    "13": "loan_agreement",
    "14": "moa_aoa",
    "15": "noc",
    "16": "pan",
    "17": "partnership_deed",
    "18": "passport",
    "19": "power_of_attorney",
    "20": "profit_and_loss",
    "21": "salary_slip",
    "22": "sanction_letter"
  },
  "initializer_range": 0.02,
  "input_size": 224,
  "intermediate_size": 3072,
  "label2id": {
    "aadhaar": 0,
    "audited_financials": 1,
    "balance_sheet": 2,
    "bank_statement": 3,
    "board_resolution": 4,
    "cash_flow_statement": 5,
    "form_16": 6,
    "gstr_1": 7,
    "gstr_3b": 8,
    "guarantee_letter": 9,
    "indemnity_bond": 10,
    "itr_full": 11,
    "itr_v": 12,
    "loan_agreement": 13,
    "moa_aoa": 14,
    "noc": 15,
    "pan": 16,
    "partnership_deed": 17,
    "passport": 18,
    "power_of_attorney": 19,
    "profit_and_loss": 20,
    "salary_slip": 21,
    "sanction_letter": 22
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "max_rel_2d_pos": 256,
  "max_rel_pos": 128,
  "model_type": "layoutlmv3",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "rel_2d_pos_bins": 64,
  "rel_pos_bins": 32,
  "second_input_size": 112,
  "shape_size": 128,
  "text_embed": true,
  "torch_dtype": "float32",
  "transformers_version": "4.46.3",
  "type_vocab_size": 1,
  "visual_embed": true,
  "vocab_size": 50265
}
